package com.hongsou.insist.tangfengguyun;

/**
 * @author lpc
 *         <p>
 * @copyright 鸿搜网络公司 版权所有
 * <p>
 * @date 2018/10/30
 * <p>
 * @desc
 */

public class Constant {

    private static String[] name1 = new String[]{"《望庐山瀑布日》", "《出塞》", "《春晓》",
            "《杂诗》", "《寻隐者不遇》", "《早发白帝城》", "《九月九日忆山东兄弟》", "《登鹳雀楼》"};
    private static String[] name2 = new String[]{"《静夜思》", "《凉州词》",
            "《赤壁》", "《近试上张水部》", "《伊州歌》", "《哥舒歌》", "《宫词》"};
    private static String[] name3 = new String[]{"《青松》", "《送别》", "《八阵图》", "《红豆》",
            "《鹿柴》", "《送孟浩然之广陵》", "《江雪》", "《枫桥夜泊》"};

    private static String[] author1 = new String[]{"李白", "王昌龄", "孟浩然", "王维", "贾岛", "李白", "王维", "王之涣"};
    private static String[] author2 = new String[]{"李白", "王翰", "杜牧", "朱庆余", "益嘉运", "西鄙人", "张祜"};
    private static String[] author3 = new String[]{"陈毅", "王维", "杜甫", "王维", "王维", "李白", "柳宗元", "张继"};

    private static String[] content1 = new String[]{"日照香炉生紫烟，\n遥看瀑布挂前川。\n飞流直下三千尺，\n疑是银河落九天。\n",
            "秦时明月汉时关，\n万里长征人未还。\n但使龙城飞将在，\n不教胡马度阴山。\n ",
            "春眠不觉晓，\n处处闻啼鸟。\n夜来风雨声，\n花落知多少。\n",
            "君自故乡来，\n应知故乡事。\n来日绮窗前，\n寒梅著花未？",
            "松下问童子，\n言师采药去。\n只在此山中，\n云深不知处。\n",
            "朝辞白帝彩云间，\n千里江陵一日还。\n两岸猿声啼不住，\n轻舟已过万重山。\n",
            "独在异乡为异客，\n每逢佳节倍思亲。\n遥知兄弟登高处，\n遍插茱萸少一人。\n",
            "白日依山尽，\n黄河入海流。\n欲穷千里目，\n更上一层楼。\n"
    };
    private static String[] content2 = new String[]{
            "床前明月光，\n疑是地上霜。\n举头望明月，\n低头思故乡。\n",
            "葡萄美酒夜光杯，\n欲饮琵琶马上催。\n醉卧沙场君莫笑，\n古来征战几人回？",
            "折戟沉沙铁未销，\n自将磨洗认前朝。\n东风不与周郎便，\n铜雀春深锁二乔。\n",
            "洞房昨夜停红烛，\n待晓堂前拜舅姑。\n妆罢低声问夫婿，\n画眉深浅入时无？",
            "打起黄莺儿，\n莫教枝上啼。\n啼时惊妾梦，\n不得到辽西。\n",
            "北斗七星高，\n哥舒夜带刀。\n至今窥牧马，\n不敢过临洮。\n",
            "故国三千里，\n深宫二十年。\n一声何满子，\n双泪落君前。\n"
    };
    private static String[] content3 = new String[]{
            "大雪压青松，\n青松挺且直。\n要知松高洁，\n待到雪化时。\n",
            "山中相送罢，\n日暮掩柴扉。\n春草年年绿，\n王孙归不归。\n",
            "功盖三分国，\n名高八阵图。\n江流石不转，\n遗恨失吞吴。\n",
            "红豆生南国，\n春来发几枝。\n愿君多采撷，\n此物最相思。\n",
            "空山不见人，\n但闻人语响。\n返景入深林，\n复照青苔上。\n",
            "故人西辞黄鹤楼，\n烟花三月下扬州。\n孤帆远影碧空尽，\n唯见长江天际流。\n",
            "千山鸟飞绝，\n万径人踪灭。\n孤舟蓑笠翁，\n独钓寒江雪。\n",
            "月落乌啼霜满天，\n江枫渔火对愁眠。\n姑苏城外寒山寺，\n夜半钟声到客船。\n"
    };

    private static String[] infoName1 = new String[]{"望庐山瀑布日", "出塞", "春晓",
            "杂诗", "寻隐者不遇", "早发白帝城", "九月九日忆山东兄弟", "登鹳雀楼"};
    private static String[] infoName2 = new String[]{"静夜思", "凉州词",
            "赤壁", "近试上张水部", "伊州歌", "哥舒歌", "宫词"};
    private static String[] infoName3 = new String[]{"青松", "送别", "八阵图", "红豆",
            "鹿柴", "送孟浩然之广陵", "江雪", "枫桥夜泊"};


    private static String[] info1 = new String[]{
            "日照香炉生紫烟,遥看瀑布挂前川。飞流直下三千尺,疑是银河落九天。",
            "秦时明月汉时关,万里长征人未还。但使龙城飞将在,不教胡马度阴山。 ",
            "春眠不觉晓,处处闻啼鸟。夜来风雨声,花落知多少。",
            "君自故乡来,应知故乡事。来日绮窗前,寒梅著花未？",
            "松下问童子,言师采药去。只在此山中,云深不知处。",
            "朝辞白帝彩云间,千里江陵一日还。两岸猿声啼不住,轻舟已过万重山。",
            "独在异乡为异客,每逢佳节倍思亲。遥知兄弟登高处,遍插茱萸少一人。",
            "白日依山尽,黄河入海流。欲穷千里目,更上一层楼。"
    };
    private static String[] info2 = new String[]{
            "床前明月光,疑是地上霜。举头望明月,低头思故乡。",
            "葡萄美酒夜光杯,欲饮琵琶马上催。醉卧沙场君莫笑,古来征战几人回？",
            "折戟沉沙铁未销,自将磨洗认前朝。东风不与周郎便,铜雀春深锁二乔。",
            "洞房昨夜停红烛,待晓堂前拜舅姑。妆罢低声问夫婿,画眉深浅入时无？",
            "打起黄莺儿,莫教枝上啼。啼时惊妾梦,不得到辽西。",
            "北斗七星高,哥舒夜带刀。至今窥牧马,不敢过临洮。",
            "故国三千里,深宫二十年。一声何满子,双泪落君前。"
    };
    private static String[] info3 = new String[]{
            "大雪压青松,青松挺且直。要知松高洁,待到雪化时。",
            "山中相送罢,日暮掩柴扉。春草年年绿,王孙归不归。",
            "功盖三分国,名高八阵图。江流石不转,遗恨失吞吴。",
            "红豆生南国,春来发几枝。愿君多采撷,此物最相思。",
            "空山不见人,但闻人语响。返景入深林,复照青苔上。",
            "故人西辞黄鹤楼,烟花三月下扬州。孤帆远影碧空尽,唯见长江天际流。",
            "千山鸟飞绝,万径人踪灭。孤舟蓑笠翁,独钓寒江雪。",
            "月落乌啼霜满天,江枫渔火对愁眠。姑苏城外寒山寺,夜半钟声到客船。"
    };

    private static String[][] name = new String[][]{
            {"《望庐山瀑布日》", "《出塞》", "《春晓》",
                    "《杂诗》", "《寻隐者不遇》", "《早发白帝城》", "《九月九日忆山东兄弟》", "《登鹳雀楼》"},
            {"《静夜思》", "《凉州词》",
                    "《赤壁》", "《近试上张水部》", "《伊州歌》", "《哥舒歌》", "《宫词》"},
            {"《青松》", "《送别》", "《八阵图》", "《红豆》",
                    "《鹿柴》", "《送孟浩然之广陵》", "《江雪》", "《枫桥夜泊》"}};


    private static String[][] infoName = new String[][]{
            {"望庐山瀑布日", "出塞", "春晓", "杂诗", "寻隐者不遇", "早发白帝城", "九月九日忆山东兄弟", "登鹳雀楼"},
            {"静夜思", "凉州词", "赤壁", "近试上张水部", "伊州歌", "哥舒歌", "宫词"},
            {"青松", "送别", "八阵图", "红豆", "鹿柴", "送孟浩然之广陵", "江雪", "枫桥夜泊"}};

    private static String[][] author = new String[][]{
            {"李白", "王昌龄", "孟浩然", "王维", "贾岛", "李白", "王维", "王之涣"},
            {"李白", "王翰", "杜牧", "朱庆余", "益嘉运", "西鄙人", "张祜"},
            {"陈毅", "王维", "杜甫", "王维", "王维", "李白", "柳宗元", "张继"}};


    private static String[][] content = new String[][]{
            {
                    "日照香炉生紫烟，\n\n遥看瀑布挂前川。\n\n飞流直下三千尺，\n\n疑是银河落九天。\n\n",
                    "秦时明月汉时关，\n\n万里长征人未还。\n\n但使龙城飞将在，\n\n不教胡马度阴山。\n\n ",
                    "春眠不觉晓，\n\n处处闻啼鸟。\n\n夜来风雨声，\n\n花落知多少。\n\n",
                    "君自故乡来，\n\n应知故乡事。\n\n来日绮窗前，\n\n寒梅著花未？",
                    "松下问童子，\n\n言师采药去。\n\n只在此山中，\n\n云深不知处。\n\n",
                    "朝辞白帝彩云间，\n\n千里江陵一日还。\n\n两岸猿声啼不住，\n\n轻舟已过万重山。\n\n",
                    "独在异乡为异客，\n\n每逢佳节倍思亲。\n\n遥知兄弟登高处，\n\n遍插茱萸少一人。\n\n",
                    "白日依山尽，\n\n黄河入海流。\n\n欲穷千里目，\n\n更上一层楼。\n\n"},
            {
                    "床前明月光，\n\n疑是地上霜。\n\n举头望明月，\n\n低头思故乡。\n\n",
                    "葡萄美酒夜光杯，\n\n欲饮琵琶马上催。\n\n醉卧沙场君莫笑，\n\n古来征战几人回？",
                    "折戟沉沙铁未销，\n\n自将磨洗认前朝。\n\n东风不与周郎便，\n\n铜雀春深锁二乔。\n\n",
                    "洞房昨夜停红烛，\n\n待晓堂前拜舅姑。\n\n妆罢低声问夫婿，\n\n画眉深浅入时无？",
                    "打起黄莺儿，\n\n莫教枝上啼。\n\n啼时惊妾梦，\n\n不得到辽西。\n\n",
                    "北斗七星高，\n\n哥舒夜带刀。\n\n至今窥牧马，\n\n不敢过临洮。\n\n",
                    "故国三千里，\n\n深宫二十年。\n\n一声何满子，\n\n双泪落君前。\n\n"},
            {
                    "大雪压青松，\n\n青松挺且直。\n\n要知松高洁，\n\n待到雪化时。\n\n",
                    "山中相送罢，\n\n日暮掩柴扉。\n\n春草年年绿，\n\n王孙归不归。\n\n",
                    "功盖三分国，\n\n名高八阵图。\n\n江流石不转，\n\n遗恨失吞吴。\n\n",
                    "红豆生南国，\n\n春来发几枝。\n\n愿君多采撷，\n\n此物最相思。\n\n",
                    "空山不见人，\n\n但闻人语响。\n\n返景入深林，\n\n复照青苔上。\n\n",
                    "故人西辞黄鹤楼，\n\n烟花三月下扬州。\n\n孤帆远影碧空尽，\n\n唯见长江天际流。\n\n",
                    "千山鸟飞绝，\n\n万径人踪灭。\n\n孤舟蓑笠翁，\n\n独钓寒江雪。\n\n",
                    "月落乌啼霜满天，\n\n江枫渔火对愁眠。\n\n姑苏城外寒山寺，\n\n夜半钟声到客船。\n\n"
            }
    };

    private static String[][] info = new String[][]{
            {
                    "日照香炉生紫烟,遥看瀑布挂前川。飞流直下三千尺,疑是银河落九天。",
                    "秦时明月汉时关,万里长征人未还。但使龙城飞将在,不教胡马度阴山。 ",
                    "春眠不觉晓,处处闻啼鸟。夜来风雨声,花落知多少。",
                    "君自故乡来,应知故乡事。来日绮窗前,寒梅著花未？",
                    "松下问童子,言师采药去。只在此山中,云深不知处。",
                    "朝辞白帝彩云间,千里江陵一日还。两岸猿声啼不住,轻舟已过万重山。",
                    "独在异乡为异客,每逢佳节倍思亲。遥知兄弟登高处,遍插茱萸少一人。",
                    "白日依山尽,黄河入海流。欲穷千里目,更上一层楼。"},
            {
                    "床前明月光,疑是地上霜。举头望明月,低头思故乡。",
                    "葡萄美酒夜光杯,欲饮琵琶马上催。醉卧沙场君莫笑,古来征战几人回？",
                    "折戟沉沙铁未销,自将磨洗认前朝。东风不与周郎便,铜雀春深锁二乔。",
                    "洞房昨夜停红烛,待晓堂前拜舅姑。妆罢低声问夫婿,画眉深浅入时无？",
                    "打起黄莺儿,莫教枝上啼。啼时惊妾梦,不得到辽西。",
                    "北斗七星高,哥舒夜带刀。至今窥牧马,不敢过临洮。",
                    "故国三千里,深宫二十年。一声何满子,双泪落君前。"},
            {
                    "大雪压青松,青松挺且直。要知松高洁,待到雪化时。",
                    "山中相送罢,日暮掩柴扉。春草年年绿,王孙归不归。",
                    "功盖三分国,名高八阵图。江流石不转,遗恨失吞吴。",
                    "红豆生南国,春来发几枝。愿君多采撷,此物最相思。",
                    "空山不见人,但闻人语响。返景入深林,复照青苔上。",
                    "故人西辞黄鹤楼,烟花三月下扬州。孤帆远影碧空尽,唯见长江天际流。",
                    "千山鸟飞绝,万径人踪灭。孤舟蓑笠翁,独钓寒江雪。",
                    "月落乌啼霜满天,江枫渔火对愁眠。姑苏城外寒山寺,夜半钟声到客船。"}
    };

    public static int getImg(int position) {
        int id = 0;
        switch (position){
            case 0:
                id = R.mipmap.xiejing;
                break;
            case 1:
                id = R.mipmap.shuqing;
                break;
            case 2:
                id = R.mipmap.yongwu;
                break;
        }
        return id;
    }

    public static String getName(int position, int childPosition) {
        return name[position][childPosition];
    }

    public static String getAuthor(int position, int childPosition) {
        return author[position][childPosition];
    }

    public static String getContent(int position, int childPosition) {
        return content[position][childPosition];
    }

    public static String getInfo(int position, int childPosition) {
        return infoName[position][childPosition] + "," + author[position][childPosition] + "," + info[position][childPosition];
    }
}
